app/views/dinosaurs/_form.html.erb

SELECT "valleys".* FROM "valleys"
---
  <%= f.label :valley_id %>
  <%= f.collection_select(:valley_id, Valley.all, :id, :name) %>