app/controllers/dinosaurs_controller.rb

  def index
    @dinosaurs = Dinosaur.all
---
SELECT "dinosaurs".* FROM "dinosaurs"

  def show
    @dinosaur = Dinosaur.find( params[:id] )
---
SELECT  "dinosaurs".* FROM "dinosaurs" WHERE "dinosaurs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @dinosaur = Dinosaur.new(dinosaur_params)

    if @dinosaur.save
---
INSERT INTO "dinosaurs" ("name", "age", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Hola"], ["age", 33], ["image_url", "https://i.ytimg.com/vi/_dcojg8MFPo/maxresdefault.jpg"], ["created_at", "2017-12-08 14:26:06.079258"], ["updated_at", "2017-12-08 14:26:06.079258"]]

  def edit
    @dinosaur = Dinosaur.find(params[:id])
---
SELECT  "dinosaurs".* FROM "dinosaurs" WHERE "dinosaurs"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def update
    @dinosaur = Dinosaur.find(params[:id])
    if @dinosaur.update_attributes(dinosaur_params)
---
SELECT  "dinosaurs".* FROM "dinosaurs" WHERE "dinosaurs"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "dinosaurs" SET "image_url" = $1, "updated_at" = $2 WHERE "dinosaurs"."id" = $3  [["image_url", "http://i.ebayimg.com/00/s/MjU3WDMwMA==/z/AH0AAOSwEK9UA8uy/$_35.JPG?set_id=2"], ["updated_at", "2017-12-08 15:01:28.446863"], ["id", 11]]

  def destroy
    @dinosaur = Dinosaur.find(params[:id])

    @dinosaur.destroy
---
SELECT  "dinosaurs".* FROM "dinosaurs" WHERE "dinosaurs"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "dinosaurs" WHERE "dinosaurs"."id" = $1  [["id", 11]]